In [4]:
import pandas as pd
import numpy as np

In [2]:
l = [1,2,3]
l

[1, 2, 3]

In [5]:
np.array(l)

array([1, 2, 3])

In [6]:
pd.Series(l)

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(['karan', 'arjun', 'someone'], index=['p1', 'p2', 'p3'])

p1      karan
p2      arjun
p3    someone
dtype: object

In [9]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [10]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [12]:
v = pd.Series({'p1':'karan', 'p2':'arjun'})

In [15]:
v

p1    karan
p2    arjun
dtype: object

In [13]:
v.index

Index(['p1', 'p2'], dtype='object')

In [14]:
v.values

array(['karan', 'arjun'], dtype=object)

In [16]:
m = np.arange(10).reshape(5,2)

In [17]:
m

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [18]:
pd.DataFrame(m, index=['monday', 'tues', ''])

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [21]:
m2 =list(np.arange(9).reshape(3,3))

In [22]:
m3 = []
for i in m2:
    m3.append(list(i))
m3

[[0, 1, 2], [3, 4, 5], [6, 7, 8]]

In [23]:
pd.DataFrame(m3)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [25]:
df = pd.read_clipboard()

In [26]:
df.head()

                        Company           Contact   Country
0           Alfreds Futterkiste      Maria Anders   Germany
1    Centro comercial Moctezuma   Francisco Chang    Mexico
2                  Ernst Handel     Roland Mendel   Austria
3                Island Trading     Helen Bennett        UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri    Canada

In [53]:
df = pd.read_csv('data/sample_data.csv', index_col=0)

In [54]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [55]:
1
2
3
4

4

In [57]:
df.reset_index(inplace=True)

In [46]:
df

       index state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [30]:
df.index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')

In [37]:
df.index.values

array(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina',
       'Cornelia'], dtype=object)

In [31]:
df.columns

Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')

In [32]:
df.values

array([['NY', 'blue', 'Steak', 30, 165, 4.6],
       ['TX', 'green', 'Lamb', 2, 70, 8.3],
       ['FL', 'red', 'Mango', 12, 120, 9.0],
       ['AL', 'white', 'Apple', 4, 80, 3.3],
       ['AK', 'gray', 'Cheese', 32, 180, 1.8],
       ['TX', 'black', 'Melon', 33, 172, 9.5],
       ['TX', 'red', 'Beans', 69, 150, 2.2]], dtype=object)

In [36]:
type(df.index.values)

numpy.ndarray

In [38]:
type(df.columns.values)

numpy.ndarray

In [35]:
type(df.values)

numpy.ndarray